app/views/users/show.html.erb

SELECT  1 AS one FROM "hotels" WHERE "hotels"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  </aside>
  <% if @user.hotels.any? %>