app/controllers/comments_controller.rb

  def create
    @hotel = Hotel.find(params[:hotel_id])
    @comment = Comment.create(comment_params)
    @comment.hotel_id = @hotel.id
    @comment.user_name = current_user.name
    if @comment.save
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 ORDER BY created_at DESC LIMIT $2  [["id", 14], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "sdfsdfsfd"], ["created_at", "2017-07-02 19:32:12.287721"], ["updated_at", "2017-07-02 19:32:12.287721"]]
UPDATE "comments" SET "hotel_id" = $1, "user_name" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["hotel_id", 1], ["user_name", "kolya"], ["updated_at", "2017-07-02 20:52:13.814515"], ["id", 1]]

  def destroy
    @hotel = Hotel.find(params[:hotel_id])
    @comment = @hotel.comments.find(params[:id])
    @comment.destroy
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 ORDER BY created_at DESC LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."hotel_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["hotel_id", 18], ["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]