app/controllers/hotels_controller.rb

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 ORDER BY created_at DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@hotel= Hotel.find(params[:id])

SELECT "hotels".* FROM "hotels" ORDER BY created_at DESC
---
  def list_of_hotels
    @hotel = Hotel.all

INSERT INTO "hotels" ("title", "star_rating", "breakfast", "room_desc", "price", "address", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @hotel = Hotel.new(hotel_params)
    @hotel.user_id = current_user.id
    if @hotel.save

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 ORDER BY created_at DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @hotel = Hotel.find(params[:id])

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 ORDER BY created_at DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "hotels" SET "title" = $1, "updated_at" = $2 WHERE "hotels"."id" = $3  [["title", "sdfsdfsd"], ["updated_at", "2017-07-02 12:29:27.772635"], ["id", 1]]
---
  def update
    @hotel = Hotel.find(params[:id])

    if @hotel.update(hotel_params)

SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 ORDER BY created_at DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "hotels" WHERE "hotels"."id" = $1  [["id", 1]]
---
  def destroy
    @hotel = Hotel.find(params[:id])
    @hotel.destroy