app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."user_id" = $1 ORDER BY created_at DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "hotels" WHERE "hotels"."user_id" = $1  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @hotel = @user.hotels.paginate(page: params[:page], per_page: 2)

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "remember_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)    # Not the final implementation!
    if @user.save