app/views/hotels/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."hotel_id" = $1  [["hotel_id", 14]]
---
<h2>Comments</h2>
<% @hotel.comments.each do |comment| %>